# LDevice_SetAccCell

## Description
Change accessory parent cell by cell index.

```pascal
PROCEDURE LDevice_SetAccCell(
				handle         : HANDLE;
				cellIndex      : LONGINT;
				accessoryIndex : LONGINT;
				newCellIndex   : LONGINT);
```

```python
def vs.LDevice_SetAccCell(handle, cellIndex, accessoryIndex, newCellIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|   |
|cellIndex|LONGINT|   |
|accessoryIndex|LONGINT|   |
|newCellIndex|LONGINT|   |

## Version
Availability: from Vectorworks 2021

## Category
* Spotlight